src/test/resources/__files/fagsystem/produkt.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:produktRespons xmlns:ns2="urn:com:horntvedt:case2:fagsystem:produkt:v1">
            <avtalenummer>7246b542-53c9-42a9-a6aa-b3727db8e9c6</avtalenummer>
        </ns2:produktRespons>
    </soap:Body>
</soap:Envelope>